---
kind: method
id: M:Autodesk.Revit.DB.ICustomFieldProperties.AreEqualTo(Autodesk.Revit.DB.ICustomFieldProperties)
source: html/98d7c150-2d40-bef6-5cd0-0d1bca004ea9.htm
---
# Autodesk.Revit.DB.ICustomFieldProperties.AreEqualTo Method

Identifies if the custom field properties are equal or not.

## Syntax (C#)
```csharp
bool AreEqualTo(
	ICustomFieldProperties otherProperties
)
```

## Parameters
- **otherProperties** (`Autodesk.Revit.DB.ICustomFieldProperties`) - The other properties.

## Returns
Returns true if the custom field properties are equal, false otherwise.